fhir-test/src/fhir/batch/load-medplum.yml
config:
  target: "{{ $processEnvironment.MEDPLUM_URL }}"
  http:
    timeout: 120
  plugins:
    # https://www.artillery.io/docs/guides/plugins/plugin-publish-metrics
    publish-metrics:
      - type: cloudwatch
        region: "{{ $processEnvironment.REGION }}"
    # https://www.artillery.io/docs/guides/plugins/plugin-metrics-by-endpoint
    metrics-by-endpoint:
      # Group metrics by request name rather than URL:
      useOnlyRequestNames: true
  phases:
    # 2 users, one every 3 seconds
    - duration: 6
      arrivalCount: 2
      name: Warm up
    # 12 users, one every 5 seconds
    - duration: 60
      arrivalRate: 12
      rampTo: 50
      name: Ramp up load
  variables:
    codeChallenge: "{{ $randomString() }}"
  processor: "./batch.js"

before:
  flow:
    - log: "Get auth token"
    - post:
        url: "/auth/login"
        json:
          email: "{{ $processEnvironment.MEDPLUM_USER }}"
          password: "{{ $processEnvironment.MEDPLUM_PASSWORD }}"
          codeChallengeMethod: "plain"
          codeChallenge: "{{ codeChallenge }}"
        capture:
          - json: $.code
            as: code
        name: "Login"
    - post:
        url: "/oauth2/token"
        form:
          grant_type: "authorization_code"
          code: "{{ code }}"
          code_verifier: "{{ codeChallenge }}"
        capture:
          - json: $.access_token
            as: token
        name: "Get OAuth token"

scenarios:
  - name: "FHIR Batch Medplum Load"
    beforeScenario: makeBodyRandom
    flow:
      # - log: "Posting batch {{ requestFile }}"
      - post:
          url: "/fhir/R4/"
          headers:
            Authorization: "Bearer {{ token }}"
          json: "{{ requestBody }}"
          name: "POST Batch"